cf/Catalogs/VATWithholdingRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>VATWithholdingRates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>RateNumerator</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RateDenominator</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/VATWithholdingServerCall/Ext/Module.bsl
#Region Public

// Gets percent of VATWithholdingRate catalog item
//
// Parameters:
//  VATWithholdingRate - CatalogRef.VATWithholdingRates - ref to VATWithholdingRate catalog item
//
// Returns:
//  Number - percent
//
Function GetVATWithholdingPercent(VATWithholdingRate) Export
	
	RatesAttributes = New Structure("RateNumerator,RateDenominator", 0, 0);
	If ValueIsFilled(VATWithholdingRate) Then
		RatesAttributes = Common.ObjectAttributesValues(VATWithholdingRate, "RateNumerator,RateDenominator");
	EndIf;
	
	Return ?(RatesAttributes.RateDenominator = 0, 0, RatesAttributes.RateNumerator / RatesAttributes.RateDenominator);
	
EndFunction

// Gets VATWithholdingRate catalog item
//
// Parameters:
//  VATWithholdingCode - CatalogRef.VATWithholdingCodes - ref to VATWithholdingCode catalog item
//
// Returns:
//  CatalogRef.VATWithholdingRates - rate of VATWithholdingCode
//
Function GetVATWithholdingRate(VATWithholdingCode) Export
	
	Rate = Catalogs.VATWithholdingRates.EmptyRef();
	If ValueIsFilled(VATWithholdingCode) Then
		Rate = Common.ObjectAttributeValue(VATWithholdingCode, "Rate");
	EndIf;
	
	Return Rate;
	
EndFunction

#EndRegion
